export const messages = {
  IS_LOGIN_OK: 'Вход в аккаунт выполнен успешно',
  IS_REGISTER_OK: 'Регистрация прошла успешно',
  IS_LOGOUT_OK: 'До свидания!',
  IS_UPDATE_USER_OK: 'Профиль успешно обновлён',
  IS_MOVIES_DELETE_OK: 'Фильм успешно удалён',
  IS_MOVIES_LIKE_OK: 'Фильм успешно сохранён',

  IS_LOGIN_ERR: 'Что-то пошло не так! Вход в аккаунт не удался',
  IS_REGISTER_ERR: 'Что-то пошло не так! Регистрация не удалась',
  IS_UPDATE_USER_ERR: 'Что-то пошло не так! Обновить профиль не удалось!',
  IS_MOVIES_ERR: 'Что-то пошло не так! Фильмы не удалось загрузить.',
  IS_MOVIES_SAVED_ERR: 'Что-то пошло не так! Фильмы не удалось загрузить.',
  IS_MOVIES_DELETE_ERR: 'Что-то пошло не так! Фильм не удалось удалить.',
  IS_MOVIES_LIKE_ERR: 'Что-то пошло не так! Фильм не удалось сохранить',

  IS_LOGIN_BAD: 'Что-то пошло не так! Переданны некорректные данные при попытке входа.',
  IS_REGISTER_BAD: 'Что-то пошло не так! Переданны некорректные данные при попытке регистрации.',
  IS_UPDATE_USER_BAD: 'Что-то пошло не так! Переданны некорректные данные при попытке обновления профиля.',
  IS_MOVIES_DELETE_BAD: 'Что-то пошло не так! Переданны некорректные данные при попытке удаления фильма.',
  IS_MOVIES_LIKE_BAD: 'Что-то пошло не так! Переданны некорректные данные при попытке сохранения фильма',

  IS_LOGIN_UNAUTH: 'Ошибка! Почта или пароль не верный!',
  IS_REGISTER_CONFLICT: 'Ошибка! Пользователь с указанным email уже существует!',
  IS_UPDATE_USER_CONFLICT: 'Ошибка! Пользователь с указанным email уже существует!',
}